cask_args appdir: '/Applications'

brew 'open-completion'

# Download media contents
## See https://you-get.org/?ref=producthunt
brew 'you-get', args: ['--with-rtmpdump']
## To use post-processing options, `brew install ffmpeg` or `brew install libav`.
brew 'ffmpeg'
brew 'libav'

brew 'jrnl'
cask 'dayone-cli'
# cask 'typora'

cask 'alfred'
#cask 'cheatsheet'
cask 'appcleaner'

cask 'bartender'
cask 'bettertouchtool'

# Shell
cask 'path-finder'
# cask 'go2shell'

# Browsers
cask 'firefox'
cask 'google-chrome'
# cask 'google-chrome-canary'

# Office
cask 'skype'
cask 'telegram'
cask 'signal'
# cask 'whatsapp'
# cask 'pdfpenpro'
cask 'pdfexpert'

# Writing
cask 'marked'
cask 'markdown-service-tools'

cask 'nvalt'

cask 'notion'

# cask 'evernote'

# cask 'grammarly'

# cask 'microsoft-office'

# Reading
cask 'ridibooks'
#cask 'skim'

# Backups
cask 'dropbox'
cask 'flickr-uploadr'
cask 'google-backup-and-sync'
cask 'google-drive-file-stream'
# cask 'amazon-cloud-drive'
cask 'chronosync'

brew 'gdrive'

# Multimedia
cask 'vlc'
#cask 'elmedia-player'
cask 'air-video-server-hd'
cask 'spotify'
## https://www.google.com/nikcollection/
## cask 'google-nik-collection'
# cask 'tvmobili'

cask 'airmail-beta'

cask 'anki'
cask 'gitbook-editor'
cask 'transmission'
# cask 'webtorrent'
cask 'parallels'
# cask 'parallels-toolbox'
#cask 'bluestacks'

# Hardwares
# cask 'logitech-options'
# cask 'scansnap-manager-ix500'

# cask 'popclip'

cask 'paragon-ntfs'
# cask 'stretchlink'
# cask 'fluid'
cask 'duet'
# cask 'flux'
# cask 'onyx'
# cask 'rescuetime'

# See http://osxdaily.com/2012/12/05/how-to-remove-exif-data-from-images-quickly/
# cask 'imageoptim'

# cask 'shiori'
# cask 'platypus'

cask 'etcher'
