cask_args appdir: '/Applications'

# GNU tools
## See https://www.topbug.net/blog/2013/04/14/install-and-use-gnu-command-line-tools-in-mac-os-x/
brew 'coreutils'

# brew 'gnu-tar', args: ['—-with-default-names']
# brew 'gnu-which', args: ['—-with-default-names']
# brew 'grep', args: ['-—with-default-names']
brew 'gzip'
brew 'lsof'
brew 'less'
brew 'rsync'
brew 'colordiff'
brew 'watch'
brew 'telnet'
brew 'tree'
# brew 'awk'

# send files to OSX trash instead of deleting them
brew 'rmtrash'

# brew parallel
# brew 'moreutils' # http://zeroturnaround.com/rebellabs/5-command-line-tools-you-should-be-using/

# Development
#cask 'p4merge'
cask 'beyond-compare'

brew 'icdiff' # http://zeroturnaround.com/rebellabs/5-command-line-tools-you-should-be-using/

# tap 'homebrew/gui'
# brew 'meld'

cask 'tunnelblick'

brew 'redis'

brew 'lnav'

# Databases
#brew 'mysql'
#brew 'mytop'
#cask 'mysqlworkbench'
cask 'sequel-pro'
#cask 'dbeaver-enterprise'

# Install Cyberduck and its command line interface. See https://duck.sh/
cask 'cyberduck'
brew 'duck'



# See http://blog.outsider.ne.kr/1159
cask 'ngrok'

# See https://stackoverflow.com/questions/2925606/how-to-create-a-cpu-spike-with-a-bash-command
brew 'stress'

# See https://github.com/jkbrzt/httpie-oauth
brew 'httpie'

#cask 'sshfs'
brew 's3cmd'

# cask 'manopen'

# AWS
brew 'awscli'
#brew 'amazon-ecs-cli'

# Google Cloud Platform
cask 'google-cloud-sdk'

# Shell Development
# cask 'upterm'

# Terminal recording
## See https://asciinema.org/
brew 'asciinema'

# brew 'kafkacat'

# See https://github.com/rgcr/m-cli
brew 'm-cli'

brew 'terraform'
brew 'packer'

brew 'nmap'

brew 'jq'
brew 'yq'

#cask 'jetbrains-toolbox'

# brew 'osquery'

brew 'md5sha1sum'

# DigitalOcean
brew 'doctl'

# See https://github.com/jarulraj/sqlcheck
# tap 'gwerbin/tap'
# cask 'gwerbin/tap/sqlcheck'

# tap 'drone/drone'
# brew 'drone', args: ['--devel']

brew 'tmux'
brew 'tmuxinator-completion'

# A cat(1) clone with wings. 
brew 'bat'

# A simple, fast and user-friendly alternative to 'find' 
brew 'fd'

# Ncdu is a disk usage analyzer with an ncurses interface. 
brew 'ncdu'

brew 'yamllint'

# Travis CI command-line tool
brew 'travis'

brew 'augeas'

brew 'exa'
